#groupby()

In [1]:
import pandas as pd

In [4]:
df=pd.read_csv('D:\\Movies\\BOLLYWOOD\\Flames\\Book6.csv')
df

    id  class  study  media section
0  101     10      3      2       A
1  102     10      4      3       A
2  103     11      5      4       B
3  104     12      6      5       C
4  105      9      7      6       D

In [6]:
grp1=df.groupby(by='section')
grp1

In [8]:
grp1.groups

{'A': [0, 1], 'B': [2], 'C': [3], 'D': [4]}

In [9]:
df.groupby(['section','media']).groups

{('A', 2): [0], ('A', 3): [1], ('B', 4): [2], ('C', 5): [3], ('D', 6): [4]}

In [10]:
df.groupby(['section','class']).groups

{('A', 10): [0, 1], ('B', 11): [2], ('C', 12): [3], ('D', 9): [4]}

In [11]:
for section,df_1 in grp1:
    print(section)
    print(df_1)

A
    id  class  study  media section
0  101     10      3      2       A
1  102     10      4      3       A
B
    id  class  study  media section
2  103     11      5      4       B
C
    id  class  study  media section
3  104     12      6      5       C
D
    id  class  study  media section
4  105      9      7      6       D

In [12]:
list(grp1)

[('A',
      id  class  study  media section
  0  101     10      3      2       A
  1  102     10      4      3       A),
 ('B',
      id  class  study  media section
  2  103     11      5      4       B),
 ('C',
      id  class  study  media section
  3  104     12      6      5       C),
 ('D',
      id  class  study  media section
  4  105      9      7      6       D)]

In [13]:
dict(list(grp1))

{'A':     id  class  study  media section
 0  101     10      3      2       A
 1  102     10      4      3       A,
 'B':     id  class  study  media section
 2  103     11      5      4       B,
 'C':     id  class  study  media section
 3  104     12      6      5       C,
 'D':     id  class  study  media section
 4  105      9      7      6       D}

In [14]:
grp3=df.groupby('class').get_group(10)
grp3

    id  class  study  media section
0  101     10      3      2       A
1  102     10      4      3       A

In [15]:
grp1.sum()

          id  class  study  media
section
A        203     20      7      5
B        103     11      5      4
C        104     12      6      5
D        105      9      7      6

In [16]:
grp1.mean()

            id  class  study  media
section
A        101.5   10.0    3.5    2.5
B        103.0   11.0    5.0    4.0
C        104.0   12.0    6.0    5.0
D        105.0    9.0    7.0    6.0

In [17]:
grp1.describe()

           id                                                       class  \
        count   mean       std    min     25%    50%     75%    max count
section
A         2.0  101.5  0.707107  101.0  101.25  101.5  101.75  102.0   2.0
B         1.0  103.0       NaN  103.0  103.00  103.0  103.00  103.0   1.0
C         1.0  104.0       NaN  104.0  104.00  104.0  104.00  104.0   1.0
D         1.0  105.0       NaN  105.0  105.00  105.0  105.00  105.0   1.0

               ... study      media
         mean  ...   75%  max count mean       std  min   25%  50%   75%  max
section        ...
A        10.0  ...  3.75  4.0   2.0  2.5  0.707107  2.0  2.25  2.5  2.75  3.0
B        11.0  ...  5.00  5.0   1.0  4.0       NaN  4.0  4.00  4.0  4.00  4.0
C        12.0  ...  6.00  6.0   1.0  5.0       NaN  5.0  5.00  5.0  5.00  5.0
D         9.0  ...  7.00  7.0   1.0  6.0       NaN  6.0  6.00  6.0  6.00  6.0

[4 rows x 32 columns]

In [19]:
gr1.agg(['sum','max','mean'])

          id             class           study          media
         sum  max   mean   sum max  mean   sum max mean   sum max mean
section
A        203  102  101.5    20  10  10.0     7   4  3.5     5   3  2.5
B        103  103  103.0    11  11  11.0     5   5  5.0     4   4  4.0
C        104  104  104.0    12  12  12.0     6   6  6.0     5   5  5.0
D        105  105  105.0     9   9   9.0     7   7  7.0     6   6  6.0